Repository: hunghuy201280/flutter_crypto_wallet
Catalog: lib/l10n/intl_*.arb
Languages: vi

source: Easy way to manage your e-wallet
vi: Dễ dàng để quản lý ví điện tử của bạn

source: Manage your every penny and transaction with ease
vi: Quản lý từng xu và giao dịch của bạn một cách dễ dàng

source: Enter to your wallet
vi: Truy cập vào ví

source: Import Wallet
vi: Nhập ví

source: Create Wallet
vi: Tạo ví

source: New Password
vi: Mật khẩu mới

source: Show
vi: Hiện

source: Hide
vi: Ẩn

source: Confirm Password
vi: Xác nhận mật khẩu

source: Password
vi: Mật khẩu

# mustBeAtLeastCharacters
source: Must be at least {num} characters
vi: Phải chứa ít nhất {num} kí tự

source: I understand that {appName} cannot recover this password for me.
vi: Tôi hiểu rằng {appName} không thể khôi phục mật khẩu này cho tôi.

source: Create password
vi: Tạo mật khẩu

source: Don’t give this privatekey to anyone!
vi: Không tiết lộ private key này cho bất cứ ai!

source: Get started
vi: Bắt đầu

source: Wallet added successfully
vi: Thêm ví thành công

source: This password will unlock your wallet only on this device.
vi: Mật khẩu này chỉ mở khóa ví của bạn trên thiết bị này.

source: Welcome Back!
vi: Chào mừng trở lại!

source: Log In With Biometrics
vi: Đăng nhập bằng vân tay

source: Sign In
vi: Đăng nhập

source: Deposit Crypto
vi: Nạp tiền

source: Withdraw Crypto
vi: Rút tiền

source: Exchange Crypto
vi: Chuyển đổi tiền

source: Create New Account
vi: Tạo tài khoản mới

source: Import an Account
vi: Thêm tài khoản

source: Sign in with Biometrics ?
vi: Muốn đăng nhập bằng vân tay ?

source: Don't see your token?
vi: Không thấy token của bạn?

source: Import tokens
vi: Thêm tokens

source: Don't see your nft?
vi: Không thấy nft của bạn?

source: Import nfts
vi: Thêm nfts

source: General
vi: Chung

# generalDescription
source: Currency conversion, language
vi: Chuyển đổi tiền tệ, ngôn ngữ

source: Currency Conversion
vi: Chuyển đổi tiền tệ

source: Current Language
vi: Ngôn ngữ mặc định

# protectYourWalletDesription
source: Protect your wallet by saving your Secret Recovery Phrase in various places like on a piece of paper, password manager and/or the cloud
vi: Bảo vệ ví của bạn bằng cách lưu Cụm từ khôi phục bí mật của bạn ở nhiều nơi khác nhau như trên một mảnh giấy, trình quản lý mật khẩu và / hoặc đám mây

source: Recovery Secret Recovery Phrase
vi: Khôi phục cụm từ khôi phục bí mật

# passwordDescription
source: Choose a strong password to unclock Metamask app on your device. If you lose this password, you will need your Secret Recovery Phrase to re-import your wallet.
vi: Chọn một mật khẩu mạnh để mở khóa ứng dụng Metamask trên thiết bị của bạn. Nếu bạn mất mật khẩu này, bạn sẽ cần Cụm từ khôi phục bí mật để nhập lại ví của mình.

source: Change password
vi: Đổi mật khẩu

# securityAndPrivacy
source: Security & Privacy
vi: Chính sách và bảo mật

# securityAndPrivacyDescription
source: Privacy settings, private key and wallet Secret Recovery Phrase
vi: Cài đặt quyền riêng tư, khóa cá nhân và ví cụm từ khôi phục bí mật

source: Networks
vi: Mạng lưới

# networksDescription
source: Add and edit custom RPC networks
vi: Thêm và chỉnh sửa mạng RPC tùy chỉnh

source: Other Networks
vi: Mạng khác

source: Statistic
vi: Thống kê

source: Transaction History
vi: Lịch sử giao dịch

source: This Week
vi: Tuần này

source: This Month
vi: Tháng này

source: This Year
vi: Năm này

source: See all
vi: Xem tất cả

source: About
vi: Thông tin

source: About App Name
vi: Thông tin về App Name

source: Password not match
vi: Mật khẩu không khớp

source: Password is not empty
vi: Mật khẩu không được trống

source: Secret Recovery Phrase
vi: Cụm từ khôi phục bí mật

source: Logout
vi: Đăng xuất

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

source: Please accept policy
vi: Vui lòng chấp nhận chính sách

source: Something happened wrong
vi: Có điều gì đó đã xảy ra sai

# passwordNotMeetCondition
source: Password does not meet the conditions, character string is greater than 8
vi: Mật khẩu không thoả điều kiện, chuỗi ký tự lớn hơn 8

source: Token Contract Address
vi: Địa Chỉ Token

source: Token Symbol
vi: Biểu tượng Token

source: Token of Precision
vi: Số thập phân

source: Confirm your password
vi: Xác nhận mật khẩu hiện tại của bạn

# changePasswordSentence1
source: Before continuing we need you to confirm your password
vi: Hãy xác nhận mật khẩu hiện tại của bạn để tiếp tục

source: Confirm
vi: Xác nhận

source: Wrong Password
vi: Sai mật khẩu

source: Password changed successfully
vi: Mật khẩu đã được thay đổi

# privateKeyHint
source: e.g. 570b05a4bcdbg97afdb8ae9cd1ad8cc55dfa7x1e5d25e4dse8b8c9379f5cgfe9
vi: Ví dụ 570b05a4bcdbg97afdb8ae9cd1ad8cc55dfa7x1e5d25e4dse8b8c9379f5cgfe9

source: Invalid private key
vi: Private key không hợp lệ

# importAccountText1
source: Imported accounts will not be associated with your originally created {appName} account Secret Recovery Phrase
vi: Các tài khoản được thêm vào sẽ không được liên kết với cụm từ bí mật đã được tạo khi bạn dùng ứng dụng này.

source: Add Custom Token
vi: Thêm Token

source: Withdraw
vi: Rút tiền

source: Address
vi: Địa chỉ

# duplicateAccount
source: Account had already been added
vi: Tài khoản này đã được thêm trước đó

source: Receive
vi: Nhận

source: Copied
vi: Đã sao chép

# offline
source: You’re offline
vi: Bạn đang không kết nối internet

source: Unable to connect to the blockchain host
vi: Không thể kết nối đến máy chủ phân tán Blockchain

source: Or
vi: Hoặc

source: Max
vi: Tối đa

source: Send
vi: Gửi

source: OK
vi: Đồng ý

source: Cancel
vi: Huỷ

source: Error
vi: Lỗi

source: Alert
vi: Thông báo

source: Withdraw Success
vi: Rút tiền thành công

source: Please Input Correct Amount
vi: Vui lòng nhập đúng số tiền
